import React from "react";
import NavBar from "../Components/NavBar";
import popup from '../assets/images/popup.gif'
import "./Contact.css";

export default function ContactForm() {
  return (
 

    <div className="contact-form">
   
   
 

    <div className="contact-form-box">
      <div className="contact-form-svg">
      <img src={popup} alt="" />
      </div>
      <div className="contact-form-details">
        <h5>تواصل معنا</h5>
        <p className="contact-form-details-sub">نحن هنا لمساعدتك </p>
        <p className="contact-form-details-sub2">إذا كان لديك أي استفسارات أو تعليقات، لا تتردد في الاتصال بنا. نحن
          نحب سماع آرائك
        </p>
      </div>
    </div>

    <div className="countries">
      <div className="country">
        <p className="flags">مصر</p>
        <div className="c">
        <p>
       
      
       0123 456 7890
       <svg
         width="25"
         height="24"
         viewBox="0 0 25 24"
         fill="none"
         xmlns="http://www.w3.org/2000/svg"
       >
         <path
           d="M19.73 15.26L17.19 14.97C16.8914 14.9349 16.5886 14.968 16.3046 15.0667C16.0206 15.1654 15.7626 15.3273 15.55 15.54L13.71 17.38C10.8714 15.9359 8.5641 13.6286 7.12004 10.79L8.97004 8.94001C9.40004 8.51001 9.61004 7.91001 9.54004 7.30001L9.25004 4.78001C9.19356 4.2921 8.95951 3.84204 8.5925 3.51561C8.2255 3.18918 7.75121 3.00921 7.26004 3.01001H5.53004C4.40004 3.01001 3.46004 3.95001 3.53004 5.08001C4.06004 13.62 10.89 20.44 19.42 20.97C20.55 21.04 21.49 20.1 21.49 18.97V17.24C21.5 16.23 20.74 15.38 19.73 15.26Z"
           fill="#BBE536"
         />
       </svg>
     </p>
     <p>
    
     
       0101 234 5678
       <svg
         width="24"
         height="24"
         viewBox="0 0 24 24"
         fill="none"
         xmlns="http://www.w3.org/2000/svg"
       >
         <path
           d="M19.05 4.91005C18.1331 3.98416 17.0411 3.25002 15.8376 2.75042C14.634 2.25081 13.3431 1.99574 12.04 2.00005C6.58005 2.00005 2.13005 6.45005 2.13005 11.9101C2.13005 13.6601 2.59005 15.3601 3.45005 16.8601L2.05005 22.0001L7.30005 20.6201C8.75005 21.4101 10.38 21.8301 12.04 21.8301C17.5 21.8301 21.9501 17.3801 21.9501 11.9201C21.9501 9.27005 20.92 6.78005 19.05 4.91005ZM12.04 20.1501C10.56 20.1501 9.11005 19.7501 7.84005 19.0001L7.54005 18.8201L4.42005 19.6401L5.25005 16.6001L5.05005 16.2901C4.2276 14.9771 3.79097 13.4593 3.79005 11.9101C3.79005 7.37005 7.49005 3.67005 12.03 3.67005C14.23 3.67005 16.3 4.53005 17.85 6.09005C18.6177 6.85392 19.226 7.7626 19.6397 8.76338C20.0534 9.76417 20.2642 10.8371 20.26 11.9201C20.2801 16.4601 16.58 20.1501 12.04 20.1501ZM16.56 13.9901C16.31 13.8701 15.09 13.2701 14.87 13.1801C14.64 13.1001 14.48 13.0601 14.31 13.3001C14.14 13.5501 13.67 14.1101 13.53 14.2701C13.39 14.4401 13.24 14.4601 12.99 14.3301C12.74 14.2101 11.94 13.9401 11 13.1001C10.26 12.4401 9.77005 11.6301 9.62005 11.3801C9.48005 11.1301 9.60005 11.0001 9.73005 10.8701C9.84005 10.7601 9.98005 10.5801 10.1 10.4401C10.22 10.3001 10.27 10.1901 10.35 10.0301C10.43 9.86005 10.39 9.72005 10.33 9.60005C10.27 9.48005 9.77005 8.26005 9.57005 7.76005C9.37005 7.28005 9.16005 7.34005 9.01005 7.33005H8.53005C8.36005 7.33005 8.10005 7.39005 7.87005 7.64005C7.65005 7.89005 7.01005 8.49005 7.01005 9.71005C7.01005 10.9301 7.90005 12.1101 8.02005 12.2701C8.14005 12.4401 9.77005 14.9401 12.25 16.0101C12.84 16.2701 13.3 16.4201 13.66 16.5301C14.25 16.7201 14.79 16.6901 15.22 16.6301C15.7 16.5601 16.69 16.0301 16.89 15.4501C17.1 14.8701 17.1 14.3801 17.03 14.2701C16.96 14.1601 16.81 14.1101 16.56 13.9901Z"
           fill="#BBE536"
         />
       </svg>
     </p>
        </div>
       
      </div>
      <div className="country">
        <p className="flags">المملكة العربية السعودية</p>
        <div className="c">
        <p>
       
        
          
       0501 234 567
       <svg
         width="25"
         height="24"
         viewBox="0 0 25 24"
         fill="none"
         xmlns="http://www.w3.org/2000/svg"
       >
         <path
           d="M19.73 15.26L17.19 14.97C16.8914 14.9349 16.5886 14.968 16.3046 15.0667C16.0206 15.1654 15.7626 15.3273 15.55 15.54L13.71 17.38C10.8714 15.9359 8.5641 13.6286 7.12004 10.79L8.97004 8.94001C9.40004 8.51001 9.61004 7.91001 9.54004 7.30001L9.25004 4.78001C9.19356 4.2921 8.95951 3.84204 8.5925 3.51561C8.2255 3.18918 7.75121 3.00921 7.26004 3.01001H5.53004C4.40004 3.01001 3.46004 3.95001 3.53004 5.08001C4.06004 13.62 10.89 20.44 19.42 20.97C20.55 21.04 21.49 20.1 21.49 18.97V17.24C21.5 16.23 20.74 15.38 19.73 15.26Z"
           fill="#BBE536"
         />
       </svg>
     </p>
     <p>
  
       
       0501 234 567
       <svg
         width="24"
         height="24"
         viewBox="0 0 24 24"
         fill="none"
         xmlns="http://www.w3.org/2000/svg"
       >
         <path
           d="M19.05 4.91005C18.1331 3.98416 17.0411 3.25002 15.8376 2.75042C14.634 2.25081 13.3431 1.99574 12.04 2.00005C6.58005 2.00005 2.13005 6.45005 2.13005 11.9101C2.13005 13.6601 2.59005 15.3601 3.45005 16.8601L2.05005 22.0001L7.30005 20.6201C8.75005 21.4101 10.38 21.8301 12.04 21.8301C17.5 21.8301 21.9501 17.3801 21.9501 11.9201C21.9501 9.27005 20.92 6.78005 19.05 4.91005ZM12.04 20.1501C10.56 20.1501 9.11005 19.7501 7.84005 19.0001L7.54005 18.8201L4.42005 19.6401L5.25005 16.6001L5.05005 16.2901C4.2276 14.9771 3.79097 13.4593 3.79005 11.9101C3.79005 7.37005 7.49005 3.67005 12.03 3.67005C14.23 3.67005 16.3 4.53005 17.85 6.09005C18.6177 6.85392 19.226 7.7626 19.6397 8.76338C20.0534 9.76417 20.2642 10.8371 20.26 11.9201C20.2801 16.4601 16.58 20.1501 12.04 20.1501ZM16.56 13.9901C16.31 13.8701 15.09 13.2701 14.87 13.1801C14.64 13.1001 14.48 13.0601 14.31 13.3001C14.14 13.5501 13.67 14.1101 13.53 14.2701C13.39 14.4401 13.24 14.4601 12.99 14.3301C12.74 14.2101 11.94 13.9401 11 13.1001C10.26 12.4401 9.77005 11.6301 9.62005 11.3801C9.48005 11.1301 9.60005 11.0001 9.73005 10.8701C9.84005 10.7601 9.98005 10.5801 10.1 10.4401C10.22 10.3001 10.27 10.1901 10.35 10.0301C10.43 9.86005 10.39 9.72005 10.33 9.60005C10.27 9.48005 9.77005 8.26005 9.57005 7.76005C9.37005 7.28005 9.16005 7.34005 9.01005 7.33005H8.53005C8.36005 7.33005 8.10005 7.39005 7.87005 7.64005C7.65005 7.89005 7.01005 8.49005 7.01005 9.71005C7.01005 10.9301 7.90005 12.1101 8.02005 12.2701C8.14005 12.4401 9.77005 14.9401 12.25 16.0101C12.84 16.2701 13.3 16.4201 13.66 16.5301C14.25 16.7201 14.79 16.6901 15.22 16.6301C15.7 16.5601 16.69 16.0301 16.89 15.4501C17.1 14.8701 17.1 14.3801 17.03 14.2701C16.96 14.1601 16.81 14.1101 16.56 13.9901Z"
           fill="#BBE536"
         />
       </svg>
     </p>
        </div>
        
      </div>
    </div>

 
  

    <div className="contact-question">
  <p>سؤال عن</p>

  <div className="contact-checkboxes">
    <label className="contact-checkbox">
      <input type="checkbox" />
      <span>تصميم المتاجر الإلكترونية</span>
    </label>
    <label className="contact-checkbox">
      <input type="checkbox" />
      <span>تطوير التطبيقات</span>
    </label>
    <label className="contact-checkbox">
      <input type="checkbox" />
      <span>تطوير مواقع الويب</span>
    </label>
    <label className="contact-checkbox">
      <input type="checkbox" />
      <span>تحسين محركات البحث (SEO)</span>
    </label>
    <label className="contact-checkbox">
      <input type="checkbox" />
      <span>التسويق بالمحتوى</span>
    </label>
    <label className="contact-checkbox">
      <input type="checkbox" />
      <span>إدارة وسائل التواصل الاجتماعي</span>
    </label>
    <label className="contact-checkbox">
      <input type="checkbox" />
      <span>تصميم الهوية البصرية</span>
    </label>
    <label className="contact-checkbox">
      <input type="checkbox" />
      <span>الإعلانات المدفوعة (PPC)</span>
    </label>
  </div>
</div>


    <div className="contactform-footer">
      <div className="contactform-footer-column">
        <p>
          رقم الهاتف الخاص بك{" "}
          <span className="contactform-footer-column-span">[أختيارى]</span>{" "}
        </p>
        <input type="text" placeholder="رقم الهاتف الخاص بك" />
      </div>
      <div className="contactform-footer-column">
        <p>البريد الألكترونى</p>
        <input type="text" placeholder="البريد الألكترونى" />
      </div>
    </div>
    <div className="contactform-footer-button">
      <button>إرسال</button>
    </div>
  </div>
   
  );
}
